---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperty.Type
zh: 类型
source: html/20d79fdf-59cf-67a7-3db1-c27955e48035.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.Type Property

**中文**: 类型

Returns the type of the AssetProperty

## Syntax (C#)
```csharp
public AssetPropertyType Type { get; }
```